// 경력

const careerData = [
  {
    company: 'TMON',
    team: '프론트개발팀',
    date: '2021.07 ~ 2024.08 (3년 2개월)',
    work: '티몬 서비스의 프론트 & 백엔드 프론트 개발 업무 담당하였습니다.',
    tasks: [
      '사용자들이 가장 많이 접하는 메인 홈 프로젝트의 메인 작업자로 참여',
      '서비스 브라우저 성능 개선을 목표로 최적화 작업을 진행하여 사용자 경험 향상에 기여',
      '멀티레포 구조에서 모노레포로의 이관 및 설정 작업 수행',
      '레거시 코드와 업무 상의 비효율을 능동적으로 개선하며, 필요 시 적극적으로 의견을 제시',
      '개발 외에도 기획과 QA 업무를 지원하고, 업무 히스토리를 체계적으로 관리하기 위해 위키 문서 작성',
    ],
    imgSrc: './images/tmon_logo.jpeg',
    imgAlt: '티몬 로고 이미지',
  },
  {
    company: 'KBS',
    team: '기술지원부',
    date: '2018.04 ~ 2020.04 (2년)',
    work: 'UI 개발과 웹 디자인을 동시에 담당하였습니다.',
    tasks: [
      '사내 방송기술 웹진 홈페이지 개편 프로젝트의 메인 작업자로 진행',
      '기획, 디자인, QA, 개발의 전 과정을 메인으로 맡아 프로젝트를 성공적으로 배포',
      '사내 홈페이지 운영 및 유지보수 업무를 통해 직원들에게 안정적인 서비스 지원',
      '포스터, 배너, 현수막, 명함 등 다양한 홍보물의 디자인을 일러스트레이터와 포토샵을 활용해 제작',
      '미디어창의기술전, KOBA 등 사내외 주요 행사 운영에 참여해 팀 운영에 기여',
    ],
    imgSrc: './images/kbs_logo.png',
    imgAlt: 'KBS 로고 이미지',
  },
];

export default careerData;
